read_verilog rtl/alu.v
hierarchy -check -top alu

show -format svg -prefix alu_start -colors 1

proc;;
show -format svg -prefix alu_proc -colors 1

opt;;
show -format svg -prefix alu_opt -colors 1

stat